In [198]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [199]:
titanic=pd.read_csv('pandas/titanic.csv')

In [200]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [201]:
titanic.drop(columns=['Ticket','Fare','Cabin'],inplace=True)

In [202]:
titanic1=titanic.dropna()

In [203]:
type(titanic1)

pandas.core.frame.DataFrame

In [204]:
#titanic['Age']=titanic['Age'].replace(np.nan,0)

In [205]:
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,S
...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,Q

In [206]:
#titanic.dropna(inplace=True)

In [207]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 9 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Embarked       889 non-null object
dtypes: float64(1), int64(5), object(3)
memory usage: 62.8+ KB

In [208]:
#titanic.dropna(inplace=True)

In [209]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 9 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Embarked       889 non-null object
dtypes: float64(1), int64(5), object(3)
memory usage: 62.8+ KB

In [210]:
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,S
...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,Q

In [211]:
titanic.drop(columns=['PassengerId'],inplace=True)

In [212]:
titanic

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,S
...,...,...,...,...,...,...,...,...
886,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,S
887,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,S
888,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,S
889,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,C
890,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,Q

In [213]:
titanic1

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,S
...,...,...,...,...,...,...,...,...,...
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,Q

In [214]:
avg_age_mr=titanic1[titanic1['Name'].str.contains('Mr. ')]['Age'].mean()
avg_age_mrs=titanic1[titanic1['Name'].str.contains('Mrs. ')]['Age'].mean()
avg_age_miss=titanic1[titanic1['Name'].str.contains('Miss. ')]['Age'].mean()
avg_age_master=titanic1[titanic1['Name'].str.contains('Master. ')]['Age'].mean()
avg_age_dr=titanic1[titanic1['Name'].str.contains('Dr. ')]['Age'].mean()
avg_age_rev=titanic1[titanic1['Name'].str.contains('Rev. ')]['Age'].mean()
avg_age_don=titanic1[titanic1['Name'].str.contains('Don. ')]['Age'].mean()

In [215]:
type(avg_age_mr)

float

In [195]:
avg_age_miss

21.662068965517243

In [218]:
titanic[titanic['Name'].str.contains('Mr. ')]=titanic.replace(np.nan,avg_age_mr)
titanic[titanic['Name'].str.contains('Mrs. ')]=titanic.replace(np.nan,avg_age_mrs)
titanic[titanic['Name'].str.contains('Miss. ')]=titanic.replace(np.nan,avg_age_miss)
titanic[titanic['Name'].str.contains('Master. ')]=titanic.replace(np.nan,avg_age_master)
titanic[titanic['Name'].str.contains('Dr. ')]=titanic.replace(np.nan,avg_age_dr)
titanic[titanic['Name'].str.contains('Rev. ')]=titanic.replace(np.nan,avg_age_rev)
titanic[titanic['Name'].str.contains('Don. ')]=titanic.replace(np.nan,avg_age_don)

In [219]:
titanic

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.000000,1,0,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0,C
2,1,3,"Heikkinen, Miss. Laina",female,26.000000,0,0,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1,0,S
4,0,3,"Allen, Mr. William Henry",male,35.000000,0,0,S
...,...,...,...,...,...,...,...,...
886,0,2,"Montvila, Rev. Juozas",male,27.000000,0,0,S
887,1,1,"Graham, Miss. Margaret Edith",female,19.000000,0,0,S
888,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,21.662069,1,2,S
889,1,1,"Behr, Mr. Karl Howell",male,26.000000,0,0,C
890,0,3,"Dooley, Mr. Patrick",male,32.000000,0,0,Q

In [221]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
Survived    891 non-null int64
Pclass      891 non-null int64
Name        891 non-null object
Sex         891 non-null object
Age         891 non-null float64
SibSp       891 non-null int64
Parch       891 non-null int64
Embarked    891 non-null object
dtypes: float64(1), int64(4), object(3)
memory usage: 55.8+ KB

In [50]:
from sklearn.preprocessing import LabelEncoder
encoder=LabelEncoder()

In [51]:
titanic.drop('Fare',axis=1)

KeyError: "['Fare'] not found in axis"

In [ ]:
titanic

In [ ]:
titanic.drop('Fare',axis=1)

In [ ]:
tit=titanic.drop(['Cabin','Fare','Ticket'],axis=1)

In [ ]:
tit

In [ ]:
d=tit.groupby(['Pclass','Survived','Sex']).size()

In [ ]:
e=tit.groupby(['Pclass','Survived']).size().reset_index()
e

In [ ]:
pd.crosstab(tit['Pclass'],tit['Survived'])

In [ ]:
s=tit['SibSp']+tit['Parch']

In [ ]:
tit['Family']=s

In [ ]:
s

In [ ]:
tit

In [ ]:
tit1=tit.drop(['SibSp','Parch'],axis=1)
tit1

In [ ]:
tit1.info()

In [ ]:
pd.crosstab(tit1['Family'],tit1['Survived'])

In [ ]:
pd.crosstab(tit['SibSp'],tit['Survived'])

In [ ]:
tit['PassengerId'].count()

In [ ]:
sns.barplot(x='SibSp',y=tit.index,data=tit,hue='Survived',estimator=np.median)
plt.ylabel('No. of Passenger')
plt.show()

In [ ]:
sns.barplot(x='Family',y=tit.index,data=tit,hue='Survived',estimator=np.median)
plt.ylabel('No. of Passenger')
plt.show()

In [ ]:
tit1['Age'].info()

In [ ]:
tit1['Age'].reset_index().info()

In [ ]:
tit1['Age']=tit1['Age'].replace(np.nan, 0)

In [ ]:
tit1.info()

In [ ]:
tit1['Age'].reset_index().info()

In [ ]:
tit2=tit1[tit1['Age']<13]                               #master
tit3=tit2[tit2['Sex']=='male']
tit4=tit3[tit3['Age']>0]
tit4

In [ ]:
tit6=tit1[tit1['Age']<1000]                               #13-22=mr.
tit7=tit6[tit6['Sex']=='male']                          #23-32- =dr.
tit8=tit7[tit7['Age']>79]                               #28- =rev.
tit8                                                    #31- =don.

In [ ]:
new_tit=titanic.dropna(subset=['Age'])

In [ ]:
avg_age_mr=new_tit[new_tit['Name'].str.contains('Mr. ')]['Age'].mean()
avg_age_mrs=new_tit[new_tit['Name'].str.contains('Mrs. ')]['Age'].mean()
avg_age_miss=new_tit[new_tit['Name'].str.contains('Miss. ')]
avg_age_master=new_tit[new_tit['Name'].str.contains('Master. ')]
avg_age_dr=new_tit[new_tit['Name'].str.contains('Dr. ')]
avg_age_rev=new_tit[new_tit['Name'].str.contains('Rev. ')]
avg_age_don=new_tit[new_tit['Name'].str.contains('Don. ')]

In [ ]:
avg_age_miss['Age'].sort_values(ascending=False)

In [ ]:
tit1['Age']=tit1['Age'].replace(np.nan, 0)

In [ ]:
titanic.info()

In [ ]:
tit1[tit1['Sex']=='male']